"%[Any]@ of the following are true" = "%1$[ใด ๆ ]@ ของต่อไปนี้ถูก";
"%[All]@ of the following are true" = "%1$[ทั้งหมด]@ ของต่อไปนี้ถูก";

"%[bitrate]@ %[is]@ %@ kbps" = "%1$[อัตราบิต]@ %2$[เป็น]@ %3$@ kbps";
"%[bitrate]@ %[is not]@ %@ kbps" = "%1$[อัตราบิต]@ %2$[ไม่เป็น]@ %3$@ kbps";
"%[bitrate]@ %[is greater than]@ %@ kbps" = "%1$[อัตราบิต]@ %2$[มากกว่า]@ %3$@ kbps";
"%[bitrate]@ %[is less than]@ %@ kbps" = "%1$[อัตราบิต]@ %2$[น้อยกว่า]@ %3$@ kbps";
"%[bitrate]@ %[is in the range]@ %@ to %@ %[kbps]@" = "%1$[อัตราบิต]@ %2$[อยู่ในช่วง]@ %3$@ ถึง %4$@ %5$[kbps]@";

"%[sample_rate]@ %[is]@ %@ Hz" = "%1$[อัตราสุ่มสัญญาณ]@ %2$[เป็น]@ %3$@ Hz";
"%[sample_rate]@ %[is not]@ %@ Hz" = "%1$[อัตราสุ่มสัญญาณ]@ %2$[ไม่เป็น]@ %3$@ Hz";
"%[sample_rate]@ %[is greater than]@ %@ Hz" = "%1$[อัตราสุ่มสัญญาณ]@ %2$[มากกว่า]@ %3$@ Hz";
"%[sample_rate]@ %[is less than]@ %@ Hz" = "%1$[อัตราสุ่มสัญญาณ]@ %2$[น้อยกว่า]@ %3$@ Hz";
"%[sample_rate]@ %[is in the range]@ %@ to %@ %[Hz]@" = "%1$[อัตราสุ่มสัญญาณ]@ %2$[อยู่ในช่วง]@ %3$@ ถึง %4$@ %5$[Hz]@";

"%[bpm]@ %[is]@ %@" = "%1$[BPM]@ %2$[เป็น]@ %3$@";
"%[bpm]@ %[is not]@ %@" = "%1$[BPM]@ %2$[ไม่เป็น]@ %3$@";
"%[bpm]@ %[is greater than]@ %@" = "%1$[BPM]@ %2$[มากกว่า]@ %3$@";
"%[bpm]@ %[is less than]@ %@" = "%1$[ปี]@ %2$[น้อยกว่า]@ %3$@";
"%[bpm]@ %[is in the range]@ %@ to %@" = "%1$[BPM]@ %2$[อยู่ในช่วง]@ %3$@ ถึง %4$@";

"%[disc_number]@ %[is]@ %@" = "%1$[หมายเลขดิสก์]@ %2$[เป็น]@ %3$@";
"%[disc_number]@ %[is not]@ %@" = "%1$[หมายเลขดิสก์]@ %2$[ไม่เป็น]@ %3$@";
"%[disc_number]@ %[is greater than]@ %@" = "%1$[หมายเลขดิสก์]@ %2$[มากกว่า]@ %3$@";
"%[disc_number]@ %[is less than]@ %@" = "%1$[หมายเลขดิสก์]@ %2$[น้อยกว่า]@ %3$@";
"%[disc_number]@ %[is in the range]@ %@ to %@" = "%1$[หมายเลขดิสก์]@ %2$[อยู่ในช่วง]@ %3$@ ถึง %4$@";

"%[userplaycount]@ %[is]@ %@" = "%1$[การเล่น]@ %2$[เป็น]@ %3$@";
"%[userplaycount]@ %[is not]@ %@" = "%1$[การเล่น]@ %2$[ไม่เป็น]@ %3$@";
"%[userplaycount]@ %[is greater than]@ %@" = "%1$[การเล่น]@ %2$[มากกว่า]@ %3$@";
"%[userplaycount]@ %[is less than]@ %@" = "%1$[การเล่น]@ %2$[น้อยกว่า]@ %3$@";
"%[userplaycount]@ %[is in the range]@ %@ to %@" = "%1$[การเล่น]@ %2$[อยู่ในช่วง]@ %3$@ ถึง %4$@";

"%[season]@ %[is]@ %@" = "%1$[ภาค]@ %2$[เป็น]@ %3$@";
"%[season]@ %[is not]@ %@" = "%1$[ภาค]@ %2$[ไม่เป็น]@ %3$@";
"%[season]@ %[is greater than]@ %@" = "%1$[ภาค]@ %2$[มากกว่า]@ %3$@";
"%[season]@ %[is less than]@ %@" = "%1$[ภาค]@ %2$[น้อยกว่า]@ %3$@";
"%[season]@ %[is in the range]@ %@ to %@" = "%1$[ภาค]@ %2$[อยู่ในช่วง]@ %3$@ ถึง %4$@";

"%[userskipcount]@ %[is]@ %@" = "%1$[การข้าม]@ %2$[เป็น]@ %3$@";
"%[userskipcount]@ %[is not]@ %@" = "%1$[การข้าม]@ %2$[ไม่เป็น]@ %3$@";
"%[userskipcount]@ %[is greater than]@ %@" = "%1$[การข้าม]@ %2$[มากกว่า]@ %3$@";
"%[userskipcount]@ %[is less than]@ %@" = "%1$[การข้าม]@ %2$[น้อยกว่า]@ %3$@";
"%[userskipcount]@ %[is in the range]@ %@ to %@" = "%1$[การข้าม]@ %2$[อยู่ในช่วง]@ %3$@ ถึง %4$@";

"%[track_number]@ %[is]@ %@" = "%1$[หมายเลขแทร็ก]@ %2$[เป็น]@ %3$@";
"%[track_number]@ %[is not]@ %@" = "%1$[หมายเลขแทร็ก]@ %2$[ไม่เป็น]@ %3$@";
"%[track_number]@ %[is greater than]@ %@" = "%1$[หมายเลขแทร็ก]@ %2$[มากกว่า]@ %3$@";
"%[track_number]@ %[is less than]@ %@" = "%1$[หมายเลขแทร็ก]@ %2$[น้อยกว่า]@ %3$@";
"%[track_number]@ %[is in the range]@ %@ to %@" = "%1$[หมายเลขแทร็ก]@ %2$[อยู่ในช่วง]@ %3$@ ถึง %4$@";

"%[year]@ %[is]@ %@" = "%1$[ปี]@ %2$[เป็น]@ %3$@";
"%[year]@ %[is not]@ %@" = "%1$[ปี]@ %2$[ไม่เป็น]@ %3$@";
"%[year]@ %[is greater than]@ %@" = "%1$[ปี]@ %2$[มากกว่า]@ %3$@";
"%[year]@ %[is less than]@ %@" = "%1$[ปี]@ %2$[น้อยกว่า]@ %3$@";
"%[year]@ %[is in the range]@ %@ to %@" = "%1$[ปี]@ %2$[อยู่ในช่วง]@ %3$@ ถึง %4$@";

"%[totalsize]@ %[is]@ %@ MB" = "%1$[ขนาด]@ %2$[เป็น]@ %3$@ MB";
"%[totalsize]@ %[is not]@ %@ MB" = "%1$[ขนาด]@ %2$[ไม่เป็น]@ %3$@ MB";
"%[totalsize]@ %[is greater than]@ %@ MB" = "%1$[ขนาด]@ %2$[มากกว่า]@ %3$@ MB";
"%[totalsize]@ %[is less than]@ %@ MB" = "%1$[ขนาด]@ %2$[น้อยกว่า]@ %3$@ MB";
"%[totalsize]@ %[is in the range]@ %@ to %@ %[MB]@" = "%1$[ขนาด]@ %2$[อยู่ในช่วง]@ %3$@ ถึง %4$@ %5$[MB]@";

"%[album]@ %[contains]@ %@" = "%1$[อัลบั้ม]@ %2$[มี]@ %3$@";
"%[album]@ %[does not contain]@ %@" = "%1$[อัลบั้ม]@ %2$[ไม่มี]@ %3$@";
"%[album]@ %[is]@ %@" = "%1$[อัลบั้ม]@ %2$[เป็น]@ %3$@";
"%[album]@ %[is not]@ %@" = "%1$[อัลบั้ม]@ %2$[ไม่เป็น]@ %3$@";
"%[album]@ %[begins with]@ %@" = "%1$[อัลบั้ม]@ %2$[เริ่มด้วย]@ %3$@";
"%[album]@ %[ends with]@ %@" = "%1$[อัลบั้ม]@ %2$[สิ้นสุดด้วย]@ %3$@";

"%[album_artist]@ %[contains]@ %@" = "%1$[ศิลปินเจ้าของอัลบั้ม]@ %2$[มี]@ %3$@";
"%[album_artist]@ %[does not contain]@ %@" = "%1$[ศิลปินเจ้าของอัลบั้ม]@ %2$[ไม่มี]@ %3$@";
"%[album_artist]@ %[is]@ %@" = "%1$[ศิลปินเจ้าของอัลบั้ม]@ %2$[เป็น]@ %3$@";
"%[album_artist]@ %[is not]@ %@" = "%1$[ศิลปินเจ้าของอัลบั้ม]@ %2$[ไม่เป็น]@ %3$@";
"%[album_artist]@ %[begins with]@ %@" = "%1$[ศิลปินเจ้าของอัลบั้ม]@ %2$[เริ่มด้วย]@ %3$@";
"%[album_artist]@ %[ends with]@ %@" = "%1$[ศิลปินเจ้าของอัลบั้ม]@ %2$[สิ้นสุดด้วย]@ %3$@";

"%[artist]@ %[contains]@ %@" = "%1$[ศิลปิน]@ %2$[มี]@ %3$@";
"%[artist]@ %[does not contain]@ %@" = "%1$[ศิลปิน]@ %2$[ไม่มี]@ %3$@";
"%[artist]@ %[is]@ %@" = "%1$[ศิลปิน]@ %2$[เป็น]@ %3$@";
"%[artist]@ %[is not]@ %@" = "%1$[ศิลปิน]@ %2$[ไม่เป็น]@ %3$@";
"%[artist]@ %[begins with]@ %@" = "%1$[ศิลปิน]@ %2$[เรื่มต้นด้วย]@ %3$@";
"%[artist]@ %[ends with]@ %@" = "%1$[ศิลปิน]@ %2$[สิ้นสุดด้วย]@ %3$@";

"%[category]@ %[contains]@ %@" = "%1$[หมวดหมู่]@ %2$[มี]@ %3$@";
"%[category]@ %[does not contain]@ %@" = "%1$[หมวดหมู่]@ %2$[ไม่มี]@ %3$@";
"%[category]@ %[is]@ %@" = "%1$[หมวดหมู่]@ %2$[เป็น]@ %3$@";
"%[category]@ %[is not]@ %@" = "%1$[หมวดหมู่]@ %2$[ไม่เป็น]@ %3$@";
"%[category]@ %[begins with]@ %@" = "%1$[หมวดหมู่]@ %2$[เริ่มด้วย]@ %3$@";
"%[category]@ %[ends with]@ %@" = "%1$[หมวดหมู่]@ %2$[สิ้นสุดด้วย]@ %3$@";

"%[comments]@ %[contains]@ %@" = "%1$[ความคิดเห็น]@ %2$[มี]@ %3$@";
"%[comments]@ %[does not contain]@ %@" = "%1$[ความคิดเห็น]@ %2$[ไม่มี]@ %3$@";
"%[comments]@ %[is]@ %@" = "%1$[ความคิดเห็น]@ %2$[เป็น]@ %3$@";
"%[comments]@ %[is not]@ %@" = "%1$[ความคิดเห็น]@ %2$[ไม่เป็น]@ %3$@";
"%[comments]@ %[begins with]@ %@" = "%1$[ความคิดเห็น]@ %2$[เริ่มด้วย]@ %3$@";
"%[comments]@ %[ends with]@ %@" = "%1$[ความคิดเห็น]@ %2$[สิ้นสุดด้วย]@ %3$@";

"%[composer]@ %[contains]@ %@" = "%1$[ผู้แต่ง]@ %2$[มี]@ %3$@";
"%[composer]@ %[does not contain]@ %@" = "%1$[ผู้แต่ง]@ %2$[ไม่มี]@ %3$@";
"%[composer]@ %[is]@ %@" = "%1$[ผู้แต่ง]@ %2$[เป็น]@ %3$@";
"%[composer]@ %[is not]@ %@" = "%1$[ผู้แต่ง]@ %2$[ไม่เป็น]@ %3$@";
"%[composer]@ %[begins with]@ %@" = "%1$[ผู้แต่ง]@ %2$[เริ่มด้วย]@ %3$@";
"%[composer]@ %[ends with]@ %@" = "%1$[ผู้แต่ง]@ %2$[สิ้นสุดด้วย]@ %3$@";

"%[debug]@ %[contains]@ %@" = "%1$[ดีบั๊ก]@ %2$[มี]@ %3$@";
"%[debug]@ %[does not contain]@ %@" = "%1$[ดีบั๊ก]@ %2$[ไม่มี]@ %3$@";
"%[debug]@ %[is]@ %@" = "%1$[ดีบั๊ก]@ %2$[เป็น]@ %3$@";
"%[debug]@ %[is not]@ %@" = "%1$[ดีบั๊ก]@ %2$[ไม่เป็น]@ %3$@";
"%[debug]@ %[begins with]@ %@" = "%1$[ดีบั๊ก]@ %2$[เริ่มด้วย]@ %3$@";
"%[debug]@ %[ends with]@ %@" = "%1$[ดีบั๊ก]@ %2$[สิ้นสุดด้วย]@ %3$@";

"%[description]@ %[contains]@ %@" = "%1$[คำอธิบาย]@ %2$[มี]@ %3$@";
"%[description]@ %[does not contain]@ %@" = "%1$[คำอธิบาย]@ %2$[ไม่มี]@ %3$@";
"%[description]@ %[is]@ %@" = "%1$[คำอธิบาย]@ %2$[เป็น]@ %3$@";
"%[description]@ %[is not]@ %@" = "%1$[คำอธิบาย]@ %2$[ไม่เป็น]@ %3$@";
"%[description]@ %[begins with]@ %@" = "%1$[คำอธิบาย]@ %2$[เริ่มด้วย]@ %3$@";
"%[description]@ %[ends with]@ %@" = "%1$[คำอธิบาย]@ %2$[สิ้นสุดด้วย]@ %3$@";

"%[genre]@ %[contains]@ %@" = "%1$[แนว]@ %2$[มี]@ %3$@";
"%[genre]@ %[does not contain]@ %@" = "%1$[แนว]@ %2$[ไม่มี]@ %3$@";
"%[genre]@ %[is]@ %@" = "%1$[แนว]@ %2$[เป็น]@ %3$@";
"%[genre]@ %[is not]@ %@" = "%1$[แนว]@ %2$[ไม่เป็น]@ %3$@";
"%[genre]@ %[begins with]@ %@" = "%1$[แนว]@ %2$[เริ่มด้วย]@ %3$@";
"%[genre]@ %[ends with]@ %@" = "%1$[แนว]@ %2$[สิ้นสุดด้วย]@ %3$@";

"%[grouping]@ %[contains]@ %@" = "%1$[การจัดกลุ่ม]@ %2$[มี]@ %3$@";
"%[grouping]@ %[does not contain]@ %@" = "%1$[การจัดกลุ่ม]@ %2$[ไม่มี]@ %3$@";
"%[grouping]@ %[is]@ %@" = "%1$[การจัดกลุ่ม]@ %2$[เป็น]@ %3$@";
"%[grouping]@ %[is not]@ %@" = "%1$[การจัดกลุ่ม]@ %2$[ไม่เป็น]@ %3$@";
"%[grouping]@ %[begins with]@ %@" = "%1$[การจัดกลุ่ม]@ %2$[เริ่มด้วย]@ %3$@";
"%[grouping]@ %[ends with]@ %@" = "%1$[การจัดกลุ่ม]@ %2$[สิ้นสุดด้วย]@ %3$@";

"%[kind]@ %[contains]@ %@" = "%1$[ชนิด]@ %2$[มี]@ %3$@";
"%[kind]@ %[does not contain]@ %@" = "%1$[ชนิด]@ %2$[ไม่มี]@ %3$@";
"%[kind]@ %[is]@ %@" = "%1$[ชนิด]@ %2$[เป็น]@ %3$@";
"%[kind]@ %[is not]@ %@" = "%1$[ชนิด]@ %2$[ไม่เป็น]@ %3$@";
"%[kind]@ %[begins with]@ %@" = "%1$[ชนิด]@ %2$[เริ่มด้วย]@ %3$@";
"%[kind]@ %[ends with]@ %@" = "%1$[ชนิด]@ %2$[สิ้นสุดด้วย]@ %3$@";

"%[name]@ %[contains]@ %@" = "%1$[ชื่อ]@ %2$[มี]@ %3$@";
"%[name]@ %[does not contain]@ %@" = "%1$[ชื่อ]@ %2$[ไม่มี]@ %3$@";
"%[name]@ %[is]@ %@" = "%1$[ชื่อ]@ %2$[เป็น]@ %3$@";
"%[name]@ %[is not]@ %@" = "%1$[ชื่อ]@ %2$[ไม่เป็น]@ %3$@";
"%[name]@ %[begins with]@ %@" = "%1$[ชื่อ]@ %2$[เริ่มต้นด้วย]@ %3$@";
"%[name]@ %[ends with]@ %@" = "%1$[ชื่อ]@ %2$[สินสุดด้วย]@ %3$@";

"%[series_name]@ %[contains]@ %@" = "%1$[การแสดง]@ %2$[มี]@ %3$@";
"%[series_name]@ %[does not contain]@ %@" = "%1$[การแสดง]@ %2$[ไม่มี]@ %3$@";
"%[series_name]@ %[is]@ %@" = "%1$[การแสดง]@ %2$[เป็น]@ %3$@";
"%[series_name]@ %[is not]@ %@" = "%1$[การแสดง]@ %2$[ไม่เป็น]@ %3$@";
"%[series_name]@ %[begins with]@ %@" = "%1$[การแสดง]@ %2$[เริ่มด้วย]@ %3$@";
"%[series_name]@ %[ends with]@ %@" = "%1$[การแสดง]@ %2$[สิ้นสุดด้วย]@ %3$@";

"%[sort_album]@ %[contains]@ %@" = "%1$[จัดเรียงอัลบั้ม]@ %2$[มี]@ %3$@";
"%[sort_album]@ %[does not contain]@ %@" = "%1$[จัดเรียงอัลบั้ม]@ %2$[ไม่มี]@ %3$@";
"%[sort_album]@ %[is]@ %@" = "%1$[จัดเรียงอัลบั้ม]@ %2$[เป็น]@ %3$@";
"%[sort_album]@ %[is not]@ %@" = "%1$[จัดเรียงอัลบั้ม]@ %2$[ไม่เป็น]@ %3$@";
"%[sort_album]@ %[begins with]@ %@" = "%1$[จัดเรียงอัลบั้ม]@ %2$[เริ่มด้วย]@ %3$@";
"%[sort_album]@ %[ends with]@ %@" = "%1$[จัดเรียงอัลบั้ม]@ %2$[สิ้นสุดด้วย]@ %3$@";

"%[sort_album_artist]@ %[contains]@ %@" = "%1$[จัดเรียงศิลปินเจ้าของอัลบั้ม]@ %2$[มี]@ %3$@";
"%[sort_album_artist]@ %[does not contain]@ %@" = "%1$[จัดเรียงศิลปินเจ้าของอัลบั้ม]@ %2$[ไม่มี]@ %3$@";
"%[sort_album_artist]@ %[is]@ %@" = "%1$[จัดเรียงศิลปินเจ้าของอัลบั้ม]@ %2$[เป็น]@ %3$@";
"%[sort_album_artist]@ %[is not]@ %@" = "%1$[จัดเรียงศิลปินเจ้าของอัลบั้ม]@ %2$[ไม่เป็น]@ %3$@";
"%[sort_album_artist]@ %[begins with]@ %@" = "%1$[จัดเรียงศิลปินเจ้าของอัลบั้ม]@ %2$[เริ่มด้วย]@ %3$@";
"%[sort_album_artist]@ %[ends with]@ %@" = "%1$[จัดเรียงศิลปินเจ้าของอัลบั้ม]@ %2$[สิ้นสุดด้วย]@ %3$@";

"%[sort_artist]@ %[contains]@ %@" = "%1$[จัดเรียงศิลปิน]@ %2$[มี]@ %3$@";
"%[sort_artist]@ %[does not contain]@ %@" = "%1$[จัดเรียงศิลปิน]@ %2$[ไม่มี]@ %3$@";
"%[sort_artist]@ %[is]@ %@" = "%1$[จัดเรียงศิลปิน]@ %2$[เป็น]@ %3$@";
"%[sort_artist]@ %[is not]@ %@" = "%1$[จัดเรียงศิลปิน]@ %2$[ไม่เป็น]@ %3$@";
"%[sort_artist]@ %[begins with]@ %@" = "%1$[จัดเรียงศิลปิน]@ %2$[เริ่มด้วย]@ %3$@";
"%[sort_artist]@ %[ends with]@ %@" = "%1$[จัดเรียงศิลปิน]@ %2$[สิ้นสุดด้วย]@ %3$@";

"%[sort_composer]@ %[contains]@ %@" = "%1$[จัดเรียงผู้แต่ง]@ %2$[มี]@ %3$@";
"%[sort_composer]@ %[does not contain]@ %@" = "%1$[จัดเรียงผู้แต่ง]@ %2$[ไม่มี]@ %3$@";
"%[sort_composer]@ %[is]@ %@" = "%1$[จัดเรียงผู้แต่ง]@ %2$[เป็น]@ %3$@";
"%[sort_composer]@ %[is not]@ %@" = "%1$[จัดเรียงผู้แต่ง]@ %2$[ไม่เป็น]@ %3$@";
"%[sort_composer]@ %[begins with]@ %@" = "%1$[จัดเรียงผู้แต่ง]@ %2$[เริ่มด้วย]@ %3$@";
"%[sort_composer]@ %[ends with]@ %@" = "%1$[จัดเรียงผู่้แต่ง]@ %2$[สิ้นสุดด้วย]@ %3$@";

"%[sort_name]@ %[contains]@ %@" = "%1$[จัดเรียงชื่อ]@ %2$[มี]@ %3$@";
"%[sort_name]@ %[does not contain]@ %@" = "%1$[จัดเรียงชื่อ]@ %2$[ไม่มี]@ %3$@";
"%[sort_name]@ %[is]@ %@" = "%1$[จัดเรียงชื่อ]@ %2$[เป็น]@ %3$@";
"%[sort_name]@ %[is not]@ %@" = "%1$[จัดเรียงชื่อ]@ %2$[ไม่เป็น]@ %3$@";
"%[sort_name]@ %[begins with]@ %@" = "%1$[จัดเรียงชื่อ]@ %2$[เริ่มด้วย]@ %3$@";
"%[sort_name]@ %[ends with]@ %@" = "%1$[จัดเรียงชื่อ]@ %2$[สิ้นสุดด้วย]@ %3$@";

"%[sort_series_name]@ %[contains]@ %@" = "%1$[จัดเรียงการแสดง]@ %2$[มี]@ %3$@";
"%[sort_series_name]@ %[does not contain]@ %@" = "%1$[จัดเรียงการแสดง]@ %2$[ไม่มี]@ %3$@";
"%[sort_series_name]@ %[is]@ %@" = "%1$[จัดเรียงการแสดง]@ %2$[เป็น]@ %3$@";
"%[sort_series_name]@ %[is not]@ %@" = "%1$[จัดเรียงการแสดง]@ %2$[ไม่เป็น]@ %3$@";
"%[sort_series_name]@ %[begins with]@ %@" = "%1$[จัดเรียงการแสดง]@ %2$[เริ่มด้วย]@ %3$@";
"%[sort_series_name]@ %[ends with]@ %@" = "%1$[จัดเรียงการแสดง]@ %2$[สิ้นสุดด้วย]@ %3$@";

"%[date_added]@ %[is]@ %@" = "%1$[วันที่ที่เพิ่ม]@ %2$[เป็น]@ %3$@";
"%[date_added]@ %[is not]@ %@" = "%1$[วันที่ที่เพิ่ม]@ %2$[ไม่เป็น]@ %3$@";
"%[date_added]@ %[is greater than]@ %@" = "%1$[วันที่ที่เพิ่ม]@ %2$[หลังจาก]@ %3$@";
"%[date_added]@ %[is less than]@ %@" = "%1$[วันที่ที่เพิ่ม]@ %2$[ก่อนหน้า]@ %3$@";
"%[date_added]@ %[in the last]@ %@ %[days]@" = "%1$[วันที่เพิ่ม]@ %2$[อยู่ในล่าสุด]@ %3$@ %4$[วัน]@";
"%[date_added]@ %[in the last]@ %@ %[weeks]@" = "%1$[วันที่ที่เพิ่ม]@ %2$[ใน]@ %3$@ %4$[สัปดาห์ที่ผ่านมา]@";
"%[date_added]@ %[in the last]@ %@ %[months]@" = "%1$[วันที่ที่เพิ่ม]@ %2$[ใน]@ %3$@ %4$[เดือนที่ผ่านมา]@";
"%[date_added]@ %[not in the last]@ %@ %[days]@" = "%1$[วันที่ที่เพิ่ม]@ %2$[ไม่อยู่ใน]@ %3$@ %4$[วันที่ผ่านมา]@";
"%[date_added]@ %[not in the last]@ %@ %[weeks]@" = "%1$[วันที่ที่เพิ่ม]@ %2$[ไม่อยู่ใน]@ %3$@ %4$[สัปดาห์ที่ผ่านมา]@";
"%[date_added]@ %[not in the last]@ %@ %[months]@" = "%1$[วันที่ที่เพิ่ม]@ %2$[ไม่อยู่ใน]@ %3$@ %4$[เดือนที่ผ่านมา]@";
"%[date_added]@ %[is in the range]@ %@ to %@" = "%1$[วันที่ที่เพิ่ม]@ %2$[อยู่ในช่วง]@ %3$@ ถึง %4$@";

"%[date_modified]@ %[is]@ %@" = "%1$[วันที่ที่แก้ไข]@ %2$[เป็น]@ %3$@";
"%[date_modified]@ %[is not]@ %@" = "%1$[วันที่ที่แก้ไข]@ %2$[ไม่เป็น]@ %3$@";
"%[date_modified]@ %[is greater than]@ %@" = "%1$[วันที่ที่แก้ไข]@ %2$[หลังจาก]@ %3$@";
"%[date_modified]@ %[is less than]@ %@" = "%1$[วันที่ที่แก้ไข]@ %2$[ก่อนหน้า]@ %3$@";
"%[date_modified]@ %[in the last]@ %@ %[days]@" = "%1$[วันที่ที่แก้ไข]@ %2$[ใน]@ %3$@ %4$[วันที่ผ่านมา]@";
"%[date_modified]@ %[in the last]@ %@ %[weeks]@" = "%1$[วันที่ที่แก้ไข]@ %2$[ใน]@ %3$@ %4$[สัปดาห์ที่ผ่านมา]@";
"%[date_modified]@ %[in the last]@ %@ %[months]@" = "%1$[วันที่ที่แก้ไข]@ %2$[ใน]@ %3$@ %4$[เดือนที่ผ่านมา]@";
"%[date_modified]@ %[not in the last]@ %@ %[days]@" = "%1$[วันที่ที่แก้ไข]@ %2$[ไม่อยู่ใน]@ %3$@ %4$[วันที่ผ่านมา]@";
"%[date_modified]@ %[not in the last]@ %@ %[weeks]@" = "%1$[วันที่ที่แก้ไข]@ %2$[ไม่อยู่ใน]@ %3$@ %4$[สัปดาห์ที่ผ่านมา]@";
"%[date_modified]@ %[not in the last]@ %@ %[months]@" = "%1$[วันที่ที่แก้ไข]@ %2$[ไม่อยู่ใน]@ %3$@ %4$[เดือนที่ผ่านมา]@";
"%[date_modified]@ %[is in the range]@ %@ to %@" = "%1$[วันที่ที่แก้ไข]@ %2$[อยู่ในช่วง]@ %3$@ ถึง %4$@";

"%[playdate]@ %[is]@ %@" = "%1$[ที่เล่นล่าสุด]@ %2$[เป็น]@ %3$@";
"%[playdate]@ %[is not]@ %@" = "%1$[ที่เล่นล่าสุด]@ %2$[ไม่เป็น]@ %3$@";
"%[playdate]@ %[is greater than]@ %@" = "%1$[ที่เล่นล่าสุด]@ %2$[หลังจาก]@ %3$@";
"%[playdate]@ %[is less than]@ %@" = "%1$[ที่เล่นล่าสุด]@ %2$[ก่อนหน้า]@ %3$@";
"%[playdate]@ %[in the last]@ %@ %[days]@" = "%1$[ที่เล่นล่าสุด]@ %2$[ใน]@ %3$@ %4$[วันที่ผ่านมา]@";
"%[playdate]@ %[in the last]@ %@ %[weeks]@" = "%1$[ที่เล่นล่าสุด]@ %2$[ใน]@ %3$@ %4$[สัปดาห์ที่ผ่านมา]@";
"%[playdate]@ %[in the last]@ %@ %[months]@" = "%1$[ที่เล่นล่าสุด]@ %2$[ใน]@ %3$@ %4$[เดือนที่ผ่านมา]@";
"%[playdate]@ %[not in the last]@ %@ %[days]@" = "%1$[ที่เล่นล่าสุด]@ %2$[ไม่อยู่ใน]@ %3$@ %4$[วันที่ผ่านมา]@";
"%[playdate]@ %[not in the last]@ %@ %[weeks]@" = "%1$[ที่เล่นล่าสุด]@ %2$[ไม่อยู่ใน]@ %3$@ %4$[สัปดาห์ที่ผ่านมา]@";
"%[playdate]@ %[not in the last]@ %@ %[months]@" = "%1$[ที่เล่นล่าสุด]@ %2$[ไม่อยู่ใน]@ %3$@ %4$[เดือนที่ผ่านมา]@";
"%[playdate]@ %[is in the range]@ %@ to %@" = "%1$[ที่เล่นล่าสุด]@ %2$[อยู่ในช่วง]@ %3$@ ถึง %4$@";

"%[skipdate]@ %[is]@ %@" = "%1$[ที่ข้ามล่าสุด]@ %2$[เป็น]@ %3$@";
"%[skipdate]@ %[is not]@ %@" = "%1$[ที่ข้ามล่าสุด]@ %2$[ไม่เป็น]@ %3$@";
"%[skipdate]@ %[is greater than]@ %@" = "%1$[ที่ข้ามล่าสุด]@ %2$[หลังจาก]@ %3$@";
"%[skipdate]@ %[is less than]@ %@" = "%1$[ที่ข้ามล่าสุด]@ %2$[ก่อนหน้า]@ %3$@";
"%[skipdate]@ %[in the last]@ %@ %[days]@" = "%1$[ที่ข้ามล่าสุด]@ %2$[ใน]@ %3$@ %4$[วันที่ผ่านมา]@";
"%[skipdate]@ %[in the last]@ %@ %[weeks]@" = "%1$[ที่ข้ามล่าสุด]@ %2$[ใน]@ %3$@ %4$[สัปดาห์ที่ผ่านมา]@";
"%[skipdate]@ %[in the last]@ %@ %[months]@" = "%1$[ที่ข้ามล่าสุด]@ %2$[ใน]@ %3$@ %4$[เดือนที่ผ่านมา]@";
"%[skipdate]@ %[not in the last]@ %@ %[days]@" = "%1$[ที่ข้ามล่าสุด]@ %2$[ไม่อยู่ใน]@ %3$@ %4$[วันที่ผ่านมา]@";
"%[skipdate]@ %[not in the last]@ %@ %[weeks]@" = "%1$[ที่ข้ามล่าสุด]@ %2$[ไม่อยู่ใน]@ %3$@ %4$[สัปดาห์ที่ผ่านมา]@";
"%[skipdate]@ %[not in the last]@ %@ %[months]@" = "%1$[ที่ข้ามล่าสุด]@ %2$[ไม่อยู่ใน]@ %3$@ %4$[เดือนที่ผ่านมา]@";
"%[skipdate]@ %[is in the range]@ %@ to %@" = "%1$[ที่ข้ามล่าสุด]@ %2$[อยู่ในช่วง]@ %3$@ ถึง %4$@";

"%[songid]@ %[is]@" = "%1$[ที่ซื้อ]@ %2$[ถูก]@";
"%[songid]@ %[is not]@" = "%1$[ที่ซื้อ]@ %2$[ผิด]@";

"%[olduserdisabled]@ %[is]@" = "%1$[เลือกอยู่]@ %2$[ถูก]@";
"%[olduserdisabled]@ %[is not]@" = "%1$[เลือกอยู่]@ %2$[ผิด]@";

"%[artwork]@ %[is]@" = "%1$[ปกอัลบั้ม]@ %2$[ถูก]@";
"%[artwork]@ %[is not]@" = "%1$[ปกอัลบั้ม]@ %2$[ผิด]@";

"%[compilation]@ %[is]@" = "%1$[ชุดรวมเพลง]@ %2$[ถูก]@";
"%[compilation]@ %[is not]@" = "%1$[ชุดรวมเพลง]@ %2$[ผิด]@";

"%[totaltime]@ %[is]@ %@" = "%1$[เวลา]@ %2$[เป็น]@ %3$@";
"%[totaltime]@ %[is not]@ %@" = "%1$[เวลา]@ %2$[ไม่เป็น]@ %3$@";
"%[totaltime]@ %[is greater than]@ %@" = "%1$[เวลา]@ %2$[มากกว่า]@ %3$@";
"%[totaltime]@ %[is less than]@ %@" = "%1$[เวลา]@ %2$[น้อยกว่า]@ %3$@";
"%[totaltime]@ %[is in the range]@ %@ to %@" = "%1$[เวลา]@ %2$[อยู่ในช่วง]@ %3$@ ถึง %4$@";

"%[albumrating]@ %[is]@ %@" = "%1$[การจัดอันดับอัลบั้ม]@ %2$[เป็น]@ %3$@";
"%[albumrating]@ %[is not]@ %@" = "%1$[การจัดอันดับอัลบั้ม]@ %2$[ไม่เป็น]@ %3$@";
"%[albumrating]@ %[is greater than]@ %@" = "%1$[การจัดอันดับอัลบั้ม]@ %2$[มากกว่า]@ %3$@";
"%[albumrating]@ %[is less than]@ %@" = "%1$[การจัดอันดับอัลบั้ม]@ %2$[น้อยกว่า]@ %3$@";
"%[albumrating]@ %[is in the range]@ %@ to %@" = "%1$[การจัดอันดับอัลบั้ม]@ %2$[อยู่ในช่วง]@ %3$@ ถึง %4$@";

"%[trackrating]@ %[is]@ %@" = "%1$[การจัดอันดับ]@ %2$[เป็น]@ %3$@";
"%[trackrating]@ %[is not]@ %@" = "%1$[การจัดอันดับ]@ %2$[ไม่เป็น]@ %3$@";
"%[trackrating]@ %[is greater than]@ %@" = "%1$[การจัดอันดับ]@ %2$[มากกว่า]@ %3$@";
"%[trackrating]@ %[is less than]@ %@" = "%1$[การจัดอันดับ]@ %2$[น้อยกว่า]@ %3$@";
"%[trackrating]@ %[is in the range]@ %@ to %@" = "%1$[การจัดอันดับ]@ %2$[อยู่ในช่วง]@ %3$@ ถึง %4$@";

"%[mediakind]@ %[is]@ %[Music]@" = "%1$[ชนิดสื่อ]@ %2$[เป็น]@ %3$[เพลง]@";
"%[mediakind]@ %[is]@ %[Music Video]@" = "%1$[ชนิดสื่อ]@ %2$[เป็น]@ %3$[วิดีโอเพลง]@";
"%[mediakind]@ %[is]@ %[Movie]@" = "%1$[ชนิดสื่อ]@ %2$[เป็น]@ %3$[ภาพยนตร์]@";
"%[mediakind]@ %[is]@ %[TV Show]@" = "%1$[ชนิดสื่อ]@ %2$[เป็น]@ %3$[รายการทีวี]@";
"%[mediakind]@ %[is]@ %[Podcast]@" = "%1$[ชนิดสื่อ]@ %2$[เป็น]@ %3$[พ็อดคาสท์]@";
"%[mediakind]@ %[is]@ %[iTunes U]@" = "%1$[ชนิดสื่อ]@ %2$[เป็น]@ %3$[iTunes U]@";
"%[mediakind]@ %[is]@ %[Audiobook]@" = "%1$[ชนิดสื่อ]@ %2$[เป็น]@ %3$[หนังสือเสียง]@";
"%[mediakind]@ %[is]@ %[Book]@" = "%1$[ชนิดสื่อ]@ %2$[เป็น]@ %3$[หนังสือ]@";
"%[mediakind]@ %[is]@ %[Voice Memo]@" = "%1$[ชนิดสื่อ]@ %2$[เป็น]@ %3$[วอยซ์เมโม]@";
"%[mediakind]@ %[is]@ %[iTunes Extras]@" = "%1$[ชนิดสื่อ]@ %2$[เป็น]@ %3$[iTunes Extras]@";
"%[mediakind]@ %[is not]@ %[Music]@" = "%1$[ชนิดสื่อ]@ %2$[ไม่เป็น]@ %3$[เพลง]@";
"%[mediakind]@ %[is not]@ %[Music Video]@" = "%1$[ชนิดสื่อ]@ %2$[ไม่เป็น]@ %3$[วิดีโอเพลง]@";
"%[mediakind]@ %[is not]@ %[Movie]@" = "%1$[ชนิดสื่อ]@ %2$[ไม่เป็น]@ %3$[ภาพยนตร์]@";
"%[mediakind]@ %[is not]@ %[TV Show]@" = "%1$[ชนิดสื่อ]@ %2$[ไม่เป็น]@ %3$[รายการทีวี]@";
"%[mediakind]@ %[is not]@ %[Podcast]@" = "%1$[ชนิดสื่อ]@ %2$[ไม่เป็น]@ %3$[พ็อดคาสท์]@";
"%[mediakind]@ %[is not]@ %[iTunes U]@" = "%1$[ชนิดสื่อ]@ %2$[ไม่เป็น]@ %3$[iTunes U]@";
"%[mediakind]@ %[is not]@ %[Audiobook]@" = "%1$[ชนิดสื่อ]@ %2$[ไม่เป็น]@ %3$[หนังสือเสียง]@";
"%[mediakind]@ %[is not]@ %[Book]@" = "%1$[ชนิดสื่อ]@ %2$[ไม่เป็น]@ %3$[หนังสือ]@";
"%[mediakind]@ %[is not]@ %[Voice Memo]@" = "%1$[ชนิดสื่อ]@ %2$[ไม่เป็น]@ %3$[วอยซ์เมโม]@";
"%[mediakind]@ %[is not]@ %[iTunes Extras]@" = "%1$[ชนิดสื่อ]@ %2$[ไม่เป็น]@ %3$[iTunes Extras]@";

"%[playlistpersistentid]@ %[is]@ %@" = "%1$[เพลย์ลีสต์]@ %2$[เป็น]@ %3$@";
"%[playlistpersistentid]@ %[is not]@ %@" = "%1$[เพลย์ลีสต์]@ %2$[ไม่เป็น]@ %3$@";

"%[trackkinds]@ %[is]@ %[local]@" = "%1$[ตำแหน่ง]@ %2$[อยู่]@ %3$[บนคอมพิวเตอร์นี้]@";
"%[trackkinds]@ %[is]@ %[iCloud]@" = "%1$[ตำแหน่ง]@ %2$[เป็น]@ %3$[iCloud]@";
"%[trackkinds]@ %[is not]@ %[local]@" = "%1$[ตำแหน่ง]@ %2$[ไม่อยู่]@ %3$[บนคอมพิวเตอร์นี้]@";
"%[trackkinds]@ %[is not]@ %[iCloud]@" = "%1$[ตำแหน่ง]@ %2$[ไม่เป็น]@ %3$[iCloud]@";

"%[icloudstatus]@ %[is]@ %[Matched]@" = "%1$[สถานะ iCloud]@ %2$[เป็น]@ %3$[ที่ตรงกัน]@";
"%[icloudstatus]@ %[is]@ %[Purchased]@" = "%1$[สถานะ iCloud]@ %2$[เป็น]@ %3$[ที่ซื้อ]@";
"%[icloudstatus]@ %[is]@ %[Uploaded]@" = "%1$[สถานะ iCloud]@ %2$[เป็น]@ %3$[ที่อัปโหลด]@";
"%[icloudstatus]@ %[is]@ %[Ineligible]@" = "%1$[สถานะ iCloud]@ %2$[เป็น]@ %3$[ไม่มีสิทธิ์]@";
"%[icloudstatus]@ %[is]@ %[Local Only]@" = "%1$[สถานะ iCloud]@ %2$[เป็น]@ %3$[ภายในเครื่องเท่านั้น]@";
"%[icloudstatus]@ %[is]@ %[Error]@" = "%1$[สถานะ iCloud]@ %2$[เป็น]@ %3$[ข้อผิดพลาด]@";
"%[icloudstatus]@ %[is]@ %[Duplicate]@" = "%1$[สถานะ iCloud]@ %2$[เป็น]@ %3$[สำเนา]@";
"%[icloudstatus]@ %[is not]@ %[Matched]@" = "%1$[สถานะ iCloud]@ %2$[ไม่เป็น]@ %3$[ที่ตรงกัน]@";
"%[icloudstatus]@ %[is not]@ %[Purchased]@" = "%1$[สถานะ iCloud]@ %2$[ไม่เป็น]@ %3$[ที่ซื้อ]@";
"%[icloudstatus]@ %[is not]@ %[Uploaded]@" = "%1$[สถานะ iCloud]@ %2$[ไม่เป็น]@ %3$[ที่อัปโหลด]@";
"%[icloudstatus]@ %[is not]@ %[Ineligible]@" = "%1$[สถานะ iCloud]@ %2$[ไม่เป็น]@ %3$[ไม่มีสิทธิ์]@";
"%[icloudstatus]@ %[is not]@ %[Local Only]@" = "%1$[สถานะ iCloud]@ %2$[ไม่เป็น]@ %3$[ภายในเครื่องเท่านั้น]@";
"%[icloudstatus]@ %[is not]@ %[Error]@" = "%1$[สถานะ iCloud]@ %2$[ไม่เป็น]@ %3$[ข้อผิดพลาด]@";
"%[icloudstatus]@ %[is not]@ %[Duplicate]@" = "%1$[สถานะ iCloud]@ %2$[ไม่เป็น]@ %3$[สำเนา]@";
